# Missing Data

In [1]:
import numpy as np
import pandas as pd

Missing data is really trouble-maker. While we were solving some problems,
Nan values prevents programs from running. That's why, we have to figure out that problem. We have two methods that solving this problem: Drop and Fill data.

## Drop Row/Column

In [2]:
weatherData = {"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,35,np.nan]}

In [3]:
weatherDataFrame=pd.DataFrame(weatherData)
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0   40.0
1      29.0     NaN   35.0
2       NaN    25.0    NaN

In [4]:
weatherDataFrame.dropna() #It's drops all row

   Istanbul  Ankara  Izmir
0      30.0    20.0   40.0

In [5]:
weatherDataFrame.dropna(axis=1) #It's drops columns which have NaN values.

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [6]:
newData = {"Istanbul":[30,29,np.nan],"Ankara":[20,np.nan,25],"Izmir":[40,35,38],"Antalya":[45,np.nan,np.nan]}
newDataFrame=pd.DataFrame(newData)
weatherDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0   40.0
1      29.0     NaN   35.0
2       NaN    25.0    NaN

In [7]:
newDataFrame.dropna(axis=1,thresh=2) #It's drops columns which have two or more NaN values.

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     35
2       NaN    25.0     38

In [8]:
newDataFrame.dropna(thresh=2) #It's drops rows which have two or more NaN values.

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0     NaN     35      NaN
2       NaN    25.0     38      NaN

## Fill Data

In [9]:
newDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     45.0
1      29.0    20.0     35     20.0
2      20.0    25.0     38     20.0

This method fill the NaN values according to the parameters it takes.